package Module_5_1;

public class RunFiveOne {
    // Оголошуємо про створення класу типу public з назвою RunFiveOne

            public static void main(String[] args){
                // Оголошуємо точку входу (метод main)

            int [] sas = {25, 11, 250, 5, 354, 324, 011, 225, 235, 3598, 1, -52, 355, 21, -999999999, 999999999};
                // Створюємо масив з чілих чисел типу int, називаємо його sas, задаємо елементи масиву

            int max = sas[0];
                //оголошуємо перемінну типу int з назвою max і задаємо їй значення = нульове (перше) значення масиву sas

            int min = sas[0];
                //оголошуємо перемінну типу int з назвою min і задаємо їй значення = нульове (перше) значення масиву sas

            for (int i = 0; i != sas.length; i ++){
                // ствоюємо цикл, ініціалізація: є перемінна з назвою і типу int, якій присвоюємо значення 0; і не дорівнює довжині масиву sas; і +1

                if(sas[i] > max){
                    // якщо і-тий елемент масиву sas більший за змінну max, то

                    max = sas[i];
                    // то змінній max присвоюємо значення і-того елементу з масиву sas
                }
                if(sas[i] < min){
                    // якщо і-тий елемент масиву sas менший за змінну min, то

                    min = sas[i];
                    // то змінній min присвоюємо значення і-того елементу з масиву sas
                }
            }
            System.out.println(min + " " + max);
                // виводимо на екран пост-екскремент змінної min
                // виводимо на екран пре -енкремент змінної max
        }
    }
